package level_4;

public class CycleFor {
    public static void main(String[] args) {
//        // for - повторяет нужное действие  необходимо кол-во раз
//        for (int i = 0; i < 10; i++) {
//            System.out.println("Привет!");
//        }

        // Пример
        /*
        Цикл for состоит из трех основных частей,
        for(инициализация; условие; изменение)
        {
            тело цикла
        }

        Инициализация - Обычно создание переменной счетчика, с которой ведется отсчет повторений (int i = 0)
        Условие - првоерка перед каждой итерацией. Если оно истино - выполняется тело цикла. Если ложно - цикл заканчивается. Например i < 10
        Изменение - оператор, который срабатывает после каждой итерации. Обычно увеличивает или умменьшает значение счетчика (i++)
         */

        // Обратный отсчет
//        for (int i = 5; i > 0; i--) {
//            System.out.println(i);
//        }
//        System.out.println("Поехали!");

//        // Несколько переменных в цикле
//        for (int left = 1, right = 10; left <= 10; left++, right--) {
//            System.out.println(left + " " + right);
//        }

        // Пример 1. Обрыатный отсчет до нового года
        for (int i = 5; i > 0; i--) {
            System.out.println(i);
        }
        System.out.println("С новым годом!");


        // Пример 2. Номера мест в вагоне
        for (int z = 0; z <= 10; z++) {
            // // Проверяем, является ли текущее число чётным
            if (z % 2 == 0) {
                System.out.println(z);
            }
        }

        // Пример 3. Подсчет общей стоимости покупок
        int n = 7;
        int totalCost = 0;
        for (int a = 1; a <= n; a++) {
            totalCost += a;
        }
        System.out.println("Общая сумма всех товаров: " + totalCost);

        // Пример 4. Координаты движущихся объектов
        for (int right = 1, left = 5; right <= 5; right++, left--){
            System.out.println(right + " " + left);
        }


    }
}
